{
  "recipes": [
    {
      "name": "Chicken Tacos",
      "cuisine": "Mexican Cuisine",
      "image": "tacos",
      "ingredients": [
        {
          "name": "Grilled Chicken",
          "glycemic_index": 45,
          "glycemic_load": 8,
          "category": 1
        },
        {
          "name": "Corn Tortillas",
          "glycemic_index": 55,
          "glycemic_load": 13,
          "category": 2
        },
        {
          "name": "Salsa",
          "glycemic_index": 10,
          "glycemic_load": 1,
          "category": 1
        },
        {
          "name": "Guacamole",
          "glycemic_index": 15,
          "glycemic_load": 1,
          "category": 1
        },
        {
          "name": "Lettuce",
          "glycemic_index": 15,
          "glycemic_load": 0,
          "category": 1
        }
      ],
      "instructions": [
        "Preheat your grill to medium-high heat and season the chicken breasts with salt, pepper, and optional spices like cumin or chili powder.",
        "Lightly oil the grill grates and cook the chicken for 6-8 minutes on each side until fully cooked.",
        "Remove the chicken from the grill, let it rest for a few minutes, then slice into thin strips.",
        "Warm the corn tortillas by heating them on a skillet over medium heat for about 30 seconds on each side or wrap them in foil and warm in the oven.",
        "Place a warm tortilla on a plate and layer it with sliced grilled chicken.",
        "Add a spoonful of salsa and a dollop of guacamole over the chicken.",
        "Top with shredded lettuce for added crunch.",
        "Repeat the assembly for the remaining tortillas.",
        "Serve immediately and enjoy your homemade chicken tacos."
      ]
    },
    {
      "name": "Biryani",
      "cuisine": "Indian Cuisine",
      "image": "biryani",
      "ingredients": [
        {
          "name": "Basmati Rice",
          "glycemic_index": 70,
          "glycemic_load": 25,
          "category": 3
        },
        {
          "name": "Chicken",
          "glycemic_index": 45,
          "glycemic_load": 8,
          "category": 1
        },
        {
          "name": "Yogurt",
          "glycemic_index": 35,
          "glycemic_load": 3,
          "category": 1
        },
        {
          "name": "Onions",
          "glycemic_index": 10,
          "glycemic_load": 1,
          "category": 1
        },
        {
          "name": "Spices (Turmeric, Cumin, Coriander)",
          "glycemic_index": 5,
          "glycemic_load": 0,
          "category": 1
        }
      ],
      "instructions": [
        "In a large bowl, mix yogurt with turmeric, cumin, coriander, and salt to create a marinade.",
        "Add chicken pieces to the marinade, ensuring they are well-coated. Cover and refrigerate for at least 2 hours or overnight.",
        "Rinse the basmati rice under cold water until the water runs clear to remove excess starch.",
        "Heat oil in a pot over medium heat and sauté sliced onions until golden brown.",
        "Add spices to the onions and cook for an additional minute to release their flavors.",
        "Add the rinsed rice to the pot and stir to coat the grains with the spice mixture.",
        "Pour in water according to the rice package instructions, bring to a boil, then reduce heat to low and simmer until the rice is cooked.",
        "Preheat your oven to 350°F (175°C).",
        "In an oven-safe dish, layer the marinated chicken at the bottom.",
        "Spread the cooked rice evenly over the chicken layer.",
        "Cover the dish with foil or a lid to seal in moisture.",
        "Bake for 30-40 minutes until the chicken is fully cooked and the flavors have melded.",
        "Gently mix the rice and chicken layers before serving.",
        "Garnish with fresh cilantro or fried onions if desired.",
        "Serve hot and enjoy your flavorful biryani."
      ]
    },
    {
      "name": "Vegetable Stir-Fry",
      "cuisine": "Chinese Cuisine",
      "image": "veg-stir-fry",
      "ingredients": [
        {
          "name": "Broccoli",
          "glycemic_index": 10,
          "glycemic_load": 1,
          "category": 1
        },
        {
          "name": "Carrot",
          "glycemic_index": 47,
          "glycemic_load": 3,
          "category": 1
        },
        {
          "name": "Soy Sauce",
          "glycemic_index": 15,
          "glycemic_load": 0,
          "category": 1
        },
        {
          "name": "Garlic",
          "glycemic_index": 30,
          "glycemic_load": 1,
          "category": 1
        },
        {
          "name": "Ginger",
          "glycemic_index": 15,
          "glycemic_load": 1,
          "category": 1
        }
      ],
      "instructions": [
        "Wash and cut the broccoli into florets and slice the carrots thinly.",
        "Mince the garlic and grate or finely chop the ginger.",
        "Heat a wok or large skillet over medium-high heat and add a tablespoon of oil.",
        "Add the minced garlic and ginger to the hot oil and stir-fry for about 30 seconds until fragrant.",
        "Add the broccoli and carrots to the pan.",
        "Stir-fry the vegetables for 5-7 minutes until they are tender but still crisp.",
        "Pour soy sauce over the vegetables and stir to coat evenly.",
        "Cook for an additional 2 minutes to allow the flavors to meld.",
        "Remove from heat and transfer to a serving dish.",
        "Serve hot, optionally over steamed rice or noodles."
      ]
    },
    {
      "name": "Lasagna",
      "cuisine": "Italian Cuisine",
      "image": "lasagna",
      "ingredients": [
        {
          "name": "Lasagna Noodles",
          "glycemic_index": 63,
          "glycemic_load": 22,
          "category": 2
        },
        {
          "name": "Ground Beef",
          "glycemic_index": 45,
          "glycemic_load": 9,
          "category": 1
        },
        {
          "name": "Tomato Sauce",
          "glycemic_index": 38,
          "glycemic_load": 2,
          "category": 1
        },
        {
          "name": "Mozzarella Cheese",
          "glycemic_index": 27,
          "glycemic_load": 1,
          "category": 1
        }
      ],
      "instructions": [
        "Preheat your oven to 350°F (175°C).",
        "Cook lasagna noodles according to package instructions until al dente. Drain and set aside.",
        "In a skillet over medium heat, brown the ground beef, breaking it into small pieces as it cooks.",
        "Drain any excess fat from the skillet.",
        "Add tomato sauce to the cooked beef, stir well, and let it simmer for 5-10 minutes.",
        "In a baking dish, spread a thin layer of the meat sauce on the bottom.",
        "Place a layer of lasagna noodles over the sauce.",
        "Add another layer of meat sauce over the noodles and sprinkle with mozzarella cheese.",
        "Repeat the layering process until all ingredients are used, ending with a layer of cheese on top.",
        "Cover the baking dish with aluminum foil to prevent the cheese from burning.",
        "Bake for 25 minutes, then remove the foil and bake for an additional 5-10 minutes until the cheese is bubbly and golden brown.",
        "Allow the lasagna to rest for 10 minutes before slicing.",
        "Serve hot and enjoy your homemade lasagna."
      ]
    },
    {
      "name": "Paneer Tikka",
      "cuisine": "Indian Cuisine",
      "image": "paneer-tikka",
      "ingredients": [
        {
          "name": "Paneer",
          "glycemic_index": 27,
          "glycemic_load": 6,
          "category": 1
        },
        {
          "name": "Yogurt",
          "glycemic_index": 35,
          "glycemic_load": 3,
          "category": 1
        },
        {
          "name": "Spices (Turmeric, Cumin, Coriander)",
          "glycemic_index": 5,
          "glycemic_load": 0,
          "category": 1
        },
        {
          "name": "Bell Pepper",
          "glycemic_index": 15,
          "glycemic_load": 1,
          "category": 1
        }
      ],
      "instructions": [
        "In a bowl, mix yogurt with turmeric, cumin, coriander, chili powder, and salt to create a marinade.",
        "Cut the paneer and bell pepper into equal-sized cubes.",
        "Add the paneer and bell pepper to the marinade, ensuring all pieces are well-coated.",
        "Cover and refrigerate for at least 30 minutes to allow flavors to meld.",
        "Soak wooden skewers in water for 15 minutes if using them.",
        "Thread the marinated paneer and bell pepper onto skewers, alternating between them.",
        "Preheat your grill or grill pan to medium heat and lightly oil the grates.",
        "Grill the skewers for 3-4 minutes on each side until the paneer is golden and slightly charred.",
        "Remove from heat and serve hot with green chutney and lemon wedges."
      ]
    },
    {
      "name": "Pasta Carbonara",
      "cuisine": "Italian Cuisine",
      "image": "pasta-carbonara",
      "ingredients": [
        {
          "name": "Spaghetti",
          "glycemic_index": 55,
          "glycemic_load": 17,
          "category": 2
        },
        {
          "name": "Eggs",
          "glycemic_index": 0,
          "glycemic_load": 0,
          "category": 1
        },
        {
          "name": "Parmesan Cheese",
          "glycemic_index": 28,
          "glycemic_load": 1,
          "category": 1
        },
        {
          "name": "Bacon",
          "glycemic_index": 0,
          "glycemic_load": 0,
          "category": 1
        }
      ],
      "instructions": [
        "Bring a large pot of salted water to a boil and cook spaghetti until al dente.",
        "While the pasta cooks, beat the eggs in a bowl and mix in grated Parmesan cheese and freshly ground black pepper.",
        "In a skillet over medium heat, cook chopped bacon until crispy, then remove from heat.",
        "Reserve a cup of pasta water before draining the spaghetti.",
        "Add the hot spaghetti to the skillet with bacon and toss to combine.",
        "Quickly pour the egg and cheese mixture over the pasta, tossing continuously to create a creamy sauce.",
        "If the sauce is too thick, add reserved pasta water a little at a time to reach desired consistency.",
        "Season with additional black pepper and sprinkle with more Parmesan cheese if desired.",
        "Serve immediately while hot."
      ]
    },
    {
      "name": "Afghani Kebab",
      "cuisine": "Afghani Cuisine",
      "image": "afghani-kebab",
      "ingredients": [
        {
          "name": "Lamb",
          "glycemic_index": 45,
          "glycemic_load": 9,
          "category": 1
        },
        {
          "name": "Onions",
          "glycemic_index": 10,
          "glycemic_load": 1,
          "category": 1
        },
        {
          "name": "Garlic",
          "glycemic_index": 30,
          "glycemic_load": 1,
          "category": 1
        },
        {
          "name": "Spices (Coriander, Cumin)",
          "glycemic_index": 5,
          "glycemic_load": 0,
          "category": 1
        }
      ],
      "instructions": [
        "In a bowl, combine minced garlic, ground coriander, cumin, salt, and pepper to create a marinade.",
        "Cut the lamb into small cubes or use ground lamb. If using ground lamb, mix in finely chopped onions.",
        "Add the lamb to the marinade and mix thoroughly. Cover and refrigerate for at least 2 hours.",
        "Thread the marinated lamb pieces onto skewers.",
        "Preheat your grill to medium-high heat and lightly oil the grates.",
        "Grill the kebabs for 8-10 minutes, turning occasionally, until cooked through and nicely charred.",
        "Remove from the grill and serve hot with naan bread and a side of yogurt."
      ]
    },
    {
      "name": "Fish Curry",
      "cuisine": "Indian Cuisine",
      "image": "fish-curry",
      "ingredients": [
        {
          "name": "Fish",
          "glycemic_index": 45,
          "glycemic_load": 8,
          "category": 1
        },
        {
          "name": "Coconut Milk",
          "glycemic_index": 42,
          "glycemic_load": 6,
          "category": 1
        },
        {
          "name": "Tomato Paste",
          "glycemic_index": 38,
          "glycemic_load": 2,
          "category": 1
        },
        {
          "name": "Spices (Turmeric, Chili Powder)",
          "glycemic_index": 5,
          "glycemic_load": 0,
          "category": 1
        }
      ],
      "instructions": [
        "Clean and cut the fish into medium pieces. Season with salt and a pinch of turmeric.",
        "Optional: Lightly fry the fish pieces in oil until golden on both sides. Set aside.",
        "In a pan, heat oil and sauté chopped onions until translucent.",
        "Add minced garlic and cook for another minute.",
        "Stir in tomato paste and cook for 2 minutes to reduce acidity.",
        "Add spices like turmeric and chili powder, cooking for an additional minute.",
        "Pour in coconut milk and stir to combine. Bring to a gentle simmer.",
        "Gently add the fish pieces to the curry sauce.",
        "Simmer for 15-20 minutes until the fish is cooked through and the flavors have melded.",
        "Adjust seasoning as needed and garnish with fresh cilantro.",
        "Serve hot with steamed rice or naan bread."
      ]
    },
    {
      "name": "Chicken Stir-Fry",
      "cuisine": "Chinese Cuisine",
      "image": "chicken-stir-fry",
      "ingredients": [
        {
          "name": "Chicken",
          "glycemic_index": 45,
          "glycemic_load": 8,
          "category": 1
        },
        {
          "name": "Bell Pepper",
          "glycemic_index": 15,
          "glycemic_load": 1,
          "category": 1
        },
        {
          "name": "Soy Sauce",
          "glycemic_index": 15,
          "glycemic_load": 0,
          "category": 1
        },
        {
          "name": "Garlic",
          "glycemic_index": 30,
          "glycemic_load": 1,
          "category": 1
        }
      ],
      "instructions": [
        "Slice the chicken into thin strips and season with a pinch of salt and pepper.",
        "Cut the bell pepper into thin strips.",
        "Mince the garlic cloves.",
        "Heat a wok or large skillet over medium-high heat and add a tablespoon of oil.",
        "Add the minced garlic to the hot oil and stir-fry for about 30 seconds.",
        "Add the chicken strips to the pan and cook until they are no longer pink, about 5 minutes.",
        "Add the bell pepper slices to the pan and stir-fry for another 3-4 minutes until tender-crisp.",
        "Pour soy sauce over the mixture and stir to coat evenly.",
        "Cook for an additional 2 minutes to blend the flavors.",
        "Remove from heat and serve hot over rice or noodles."
      ]
    },
    {
      "name": "Fried Rice",
      "cuisine": "Chinese Cuisine",
      "image": "fried-rice",
      "ingredients": [
        {
          "name": "Rice",
          "glycemic_index": 72,
          "glycemic_load": 24,
          "category": 3
        },
        {
          "name": "Eggs",
          "glycemic_index": 0,
          "glycemic_load": 0,
          "category": 1
        },
        {
          "name": "Carrots",
          "glycemic_index": 47,
          "glycemic_load": 3,
          "category": 1
        },
        {
          "name": "Soy Sauce",
          "glycemic_index": 15,
          "glycemic_load": 0,
          "category": 1
        }
      ],
      "instructions": [
        "Cook rice according to package instructions and let it cool; cold rice works best.",
        "Beat the eggs in a bowl and season with a pinch of salt.",
        "Heat oil in a wok or large skillet over medium-high heat.",
        "Pour the beaten eggs into the pan and scramble them until cooked. Remove and set aside.",
        "In the same pan, add more oil if needed and sauté diced carrots until tender.",
        "Add the cooked rice to the pan and stir-fry for 2-3 minutes.",
        "Return the scrambled eggs to the pan.",
        "Pour soy sauce over the rice mixture and stir well to combine.",
        "Cook for an additional 2 minutes, stirring frequently.",
        "Serve hot as a main dish or side."
      ]
    },
    {
      "name": "Quesadilla",
      "cuisine": "Mexican Cuisine",
      "image": "quesadilla",
      "ingredients": [
        {
          "name": "Tortilla",
          "glycemic_index": 57,
          "glycemic_load": 18,
          "category": 2
        },
        {
          "name": "Cheese",
          "glycemic_index": 30,
          "glycemic_load": 1,
          "category": 1
        },
        {
          "name": "Chicken",
          "glycemic_index": 45,
          "glycemic_load": 8,
          "category": 1
        }
      ],
      "instructions": [
        "Cook and shred the chicken if not already prepared.",
        "Heat a skillet over medium heat and place a tortilla in the pan.",
        "Sprinkle a layer of cheese on one half of the tortilla.",
        "Add shredded chicken over the cheese.",
        "Fold the tortilla in half to cover the filling.",
        "Cook for 2-3 minutes on each side until the tortilla is golden brown and the cheese is melted.",
        "Remove from the pan and cut into wedges.",
        "Serve hot with salsa or sour cream."
      ]
    },
    {
      "name": "Dosa",
      "cuisine": "Indian Cuisine",
      "image": "dosa",
      "ingredients": [
        {
          "name": "Dosa Batter",
          "glycemic_index": 66,
          "glycemic_load": 20,
          "category": 2
        },
        {
          "name": "Potato Masala",
          "glycemic_index": 78,
          "glycemic_load": 15,
          "category": 3
        }
      ],
      "instructions": [
        "Heat a non-stick skillet or dosa tawa over medium heat.",
        "Pour a ladleful of dosa batter onto the center of the pan and spread it thinly in a circular motion.",
        "Drizzle a little oil around the edges of the dosa.",
        "Cook until the bottom turns golden brown and the edges start to lift.",
        "Place a spoonful of potato masala filling in the center of the dosa.",
        "Fold the dosa over the filling to form a wrap or roll.",
        "Remove from the pan and serve hot with chutney and sambar."
      ]
    },
    {
      "name": "Shrimp Fried Rice",
      "cuisine": "Chinese Cuisine",
      "image": "shrimp-fried-rice",
      "ingredients": [
        {
          "name": "Rice",
          "glycemic_index": 72,
          "glycemic_load": 24,
          "category": 3
        },
        {
          "name": "Shrimp",
          "glycemic_index": 45,
          "glycemic_load": 7,
          "category": 1
        },
        {
          "name": "Soy Sauce",
          "glycemic_index": 15,
          "glycemic_load": 0,
          "category": 1
        }
      ],
      "instructions": [
        "Cook rice and let it cool completely.",
        "Peel and devein the shrimp.",
        "Heat oil in a wok over medium-high heat.",
        "Add the shrimp and stir-fry until pink and cooked through. Remove and set aside.",
        "In the same pan, add more oil if necessary and add the cooled rice.",
        "Stir-fry the rice for 2-3 minutes.",
        "Return the cooked shrimp to the pan.",
        "Pour soy sauce over the mixture and stir well to combine.",
        "Cook for an additional 2 minutes, stirring frequently.",
        "Serve hot garnished with chopped green onions if desired."
      ]
    },
    {
      "name": "Tandoori Chicken",
      "cuisine": "Indian Cuisine",
      "image": "tandoori-chicken",
      "ingredients": [
        {
          "name": "Chicken",
          "glycemic_index": 45,
          "glycemic_load": 8,
          "category": 1
        },
        {
          "name": "Yogurt",
          "glycemic_index": 35,
          "glycemic_load": 3,
          "category": 1
        },
        {
          "name": "Spices (Turmeric, Chili Powder)",
          "glycemic_index": 5,
          "glycemic_load": 0,
          "category": 1
        }
      ],
      "instructions": [
        "In a bowl, mix yogurt with turmeric, chili powder, garam masala, ginger-garlic paste, and salt to create a marinade.",
        "Make slits in the chicken pieces to allow the marinade to penetrate.",
        "Coat the chicken thoroughly with the marinade. Cover and refrigerate for at least 4 hours or overnight.",
        "Preheat your oven to 400°F (200°C) or prepare a grill.",
        "Place the marinated chicken on a baking sheet or grill rack.",
        "Cook for 30-35 minutes, turning halfway through, until the chicken is fully cooked and has a charred appearance.",
        "Brush with melted butter or oil during cooking for extra flavor.",
        "Remove from heat and serve hot with lemon wedges and sliced onions."
      ]
    },
    {
      "name": "Eggplant Parmesan",
      "cuisine": "Italian Cuisine",
      "image": "eggplant-parmesan",
      "ingredients": [
        {
          "name": "Eggplant",
          "glycemic_index": 15,
          "glycemic_load": 1,
          "category": 1
        },
        {
          "name": "Mozzarella Cheese",
          "glycemic_index": 27,
          "glycemic_load": 1,
          "category": 1
        },
        {
          "name": "Tomato Sauce",
          "glycemic_index": 38,
          "glycemic_load": 2,
          "category": 1
        }
      ],
      "instructions": [
        "Preheat your oven to 375°F (190°C).",
        "Slice the eggplant into 1/4-inch thick rounds.",
        "Optional: Salt the eggplant slices and let them sit for 30 minutes to draw out moisture, then pat dry.",
        "Lightly coat the eggplant slices with olive oil and arrange them on a baking sheet.",
        "Bake the eggplant slices for 20 minutes until tender.",
        "In a baking dish, spread a layer of tomato sauce on the bottom.",
        "Place a layer of baked eggplant slices over the sauce.",
        "Sprinkle mozzarella cheese over the eggplant.",
        "Repeat the layering process, ending with cheese on top.",
        "Bake for 25-30 minutes until the cheese is melted and bubbly.",
        "Allow to cool for a few minutes before serving.",
        "Garnish with fresh basil if desired."
      ]
    },
    {
      "name": "Samosa",
      "cuisine": "Indian Cuisine",
      "image": "samosa",
      "ingredients": [
        {
          "name": "Pastry",
          "glycemic_index": 47,
          "glycemic_load": 10,
          "category": 1
        },
        {
          "name": "Potato",
          "glycemic_index": 78,
          "glycemic_load": 21,
          "category": 3
        },
        {
          "name": "Peas",
          "glycemic_index": 48,
          "glycemic_load": 4,
          "category": 1
        }
      ],
      "instructions": [
        "Boil potatoes until tender, then peel and mash them.",
        "In a pan, heat oil and sauté spices like cumin seeds, coriander, and garam masala.",
        "Add peas and mashed potatoes to the pan and mix well. Allow the filling to cool.",
        "Roll out the pastry dough and cut it into circles or semi-circles.",
        "Place a spoonful of filling on each piece of dough.",
        "Fold the dough over the filling to form a triangle or cone shape, sealing the edges with water.",
        "Heat oil in a deep fryer or heavy-bottomed pan.",
        "Fry the samosas in batches until they are golden brown and crispy.",
        "Remove and drain on paper towels.",
        "Serve hot with chutney or ketchup."
      ]
    },
    {
      "name": "Guacamole with Chips",
      "cuisine": "Mexican Cuisine",
      "image": "guacamole-with-chips",
      "ingredients": [
        {
          "name": "Avocado",
          "glycemic_index": 15,
          "glycemic_load": 0,
          "category": 1
        },
        {
          "name": "Tortilla Chips",
          "glycemic_index": 72,
          "glycemic_load": 25,
          "category": 3
        },
        {
          "name": "Lime",
          "glycemic_index": 32,
          "glycemic_load": 2,
          "category": 1
        }
      ],
      "instructions": [
        "Cut the avocados in half, remove the pits, and scoop the flesh into a bowl.",
        "Mash the avocado with a fork to your desired consistency.",
        "Add lime juice, chopped onions, diced tomatoes, minced garlic, and salt to taste.",
        "Mix well to combine all ingredients.",
        "Taste and adjust seasoning if necessary.",
        "Serve immediately with tortilla chips."
      ]
    },
    {
      "name": "Chapli Kebab",
      "cuisine": "Afghani Cuisine",
      "image": "chapli-kebab",
      "ingredients": [
        {
          "name": "Ground Beef",
          "glycemic_index": 45,
          "glycemic_load": 9,
          "category": 1
        },
        {
          "name": "Onions",
          "glycemic_index": 10,
          "glycemic_load": 1,
          "category": 1
        },
        {
          "name": "Garlic",
          "glycemic_index": 30,
          "glycemic_load": 1,
          "category": 1
        }
      ],
      "instructions": [
        "In a bowl, combine ground beef with finely chopped onions, minced garlic, and spices like coriander seeds, cumin, and chili flakes.",
        "Mix in a beaten egg and breadcrumbs if needed to bind the mixture.",
        "Form the mixture into flat, round patties.",
        "Heat oil in a frying pan over medium heat.",
        "Fry the patties for about 4-5 minutes on each side until cooked through and crispy on the edges.",
        "Remove from the pan and drain excess oil on paper towels.",
        "Serve hot with naan, salad, and yogurt sauce."
      ]
    },
    {
      "name": "Ravioli with Tomato Sauce",
      "cuisine": "Italian Cuisine",
      "image": "violi-with-tomato-sauce",
      "ingredients": [
        {
          "name": "Ravioli",
          "glycemic_index": 70,
          "glycemic_load": 25,
          "category": 3
        },
        {
          "name": "Tomato Sauce",
          "glycemic_index": 38,
          "glycemic_load": 2,
          "category": 1
        },
        {
          "name": "Parmesan Cheese",
          "glycemic_index": 28,
          "glycemic_load": 1,
          "category": 1
        }
      ],
      "instructions": [
        "Bring a large pot of salted water to a boil.",
        "Add ravioli and cook according to package instructions until al dente.",
        "While the ravioli cooks, heat tomato sauce in a separate saucepan over medium heat.",
        "Drain the cooked ravioli and add it to the saucepan with tomato sauce.",
        "Gently stir to coat the ravioli with sauce.",
        "Transfer to serving plates and sprinkle with grated Parmesan cheese.",
        "Serve hot and enjoy."
      ]
    },
    {
      "name": "Prawn Curry",
      "cuisine": "Indian Cuisine",
      "image": "prawn-curry",
      "ingredients": [
        {
          "name": "Prawns",
          "glycemic_index": 45,
          "glycemic_load": 8,
          "category": 1
        },
        {
          "name": "Coconut Milk",
          "glycemic_index": 42,
          "glycemic_load": 6,
          "category": 1
        },
        {
          "name": "Spices (Turmeric, Coriander)",
          "glycemic_index": 5,
          "glycemic_load": 0,
          "category": 1
        }
      ],
      "instructions": [
        "Clean and devein the prawns.",
        "In a pan, heat oil and sauté chopped onions until translucent.",
        "Add minced garlic and ginger, cooking for another minute.",
        "Stir in spices like turmeric and coriander powder.",
        "Pour in coconut milk and bring to a gentle simmer.",
        "Add the prawns to the sauce and cook for 5-7 minutes until they turn pink and are cooked through.",
        "Adjust seasoning with salt and pepper.",
        "Garnish with fresh cilantro.",
        "Serve hot with rice or naan bread."
      ]
    }
  ]
}
